In [1]:
import pandas as pd

In [4]:
record1= pd.Series({'Name':'Alice',
                    'Subject':'Chemistry',
                       'Score':82})
record2= pd.Series({'Name':'June',
                   'Subject':'Physics',
                       'Score':90})
record3= pd.Series({'Name':'Helen',
                   'Subject':'Biology',
                   'Score':94})

In [6]:
df= pd.DataFrame([record1,record2,record3],index=['school1',
                                                 'school2','school1'])
df.head()

          Name    Subject  Score
school1  Alice  Chemistry     82
school2   June    Physics     90
school1  Helen    Biology     94

In [12]:
# An alternative method. is that you could use a list of dictionaries

students= [{'Name':'Alice',
                    'Subject':'Chemistry',
                       'Score':82},
                     {'Name':'June',
                   'Subject':'Physics',
                       'Score':90},
                     {'Name':'Helen',
                   'Subject':'Biology',
                   'Score':94}]
df= pd.DataFrame(students, index=['school1','school2','school1'])

df.head()

          Name    Subject  Score
school1  Alice  Chemistry     82
school2   June    Physics     90
school1  Helen    Biology     94

In [13]:
df.loc['school2']

Name          June
Subject    Physics
Score           90
Name: school2, dtype: object

In [15]:
type(df.loc['school2'])

pandas.core.series.Series

In [16]:
df.loc['school1']

          Name    Subject  Score
school1  Alice  Chemistry     82
school1  Helen    Biology     94

In [17]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [18]:
df.loc['school1','Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [19]:
df.T

           school1  school2  school1
Name         Alice     June    Helen
Subject  Chemistry  Physics  Biology
Score           82       90       94

In [20]:
df.T.loc['Name']

school1    Alice
school2     June
school1    Helen
Name: Name, dtype: object

In [21]:
df['Name']

school1    Alice
school2     June
school1    Helen
Name: Name, dtype: object

In [22]:
type(df['Name'])

pandas.core.series.Series

In [23]:
df.loc['school1']['Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [24]:
print(type(df.loc['school1']))#should be a DataFrame
print(type(df.loc['school1']['Name']))#should be a Series

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [25]:
df.loc[:,['Name','Score']]
# The colon means that we want to get all of the rows, and the list
# in the second argument position is the list of columns we want to get back

          Name  Score
school1  Alice     82
school2   June     90
school1  Helen     94

In [26]:
df.drop('school1')

         Name  Subject  Score
school2  June  Physics     90

In [27]:
# But if we look at our original DataFrame we see that data is still intact
df

          Name    Subject  Score
school1  Alice  Chemistry     82
school2   June    Physics     90
school1  Helen    Biology     94

In [28]:
copy_df= df.copy()
copy_df.drop('Name',inplace=True,axis=1)
copy_df

           Subject  Score
school1  Chemistry     82
school2    Physics     90
school1    Biology     94

In [29]:
del copy_df['Subject']
copy_df

         Score
school1     82
school2     90
school1     94

In [30]:
#adding a new column
df['ClassRanking']= None
df

          Name    Subject  Score ClassRanking
school1  Alice  Chemistry     82         None
school2   June    Physics     90         None
school1  Helen    Biology     94         None